---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData
source: html/e7a372c3-23d4-4f9b-1058-62b25cb828a9.htm
---
# MEPAnalyticalModelData Properties

Specifies whether the .NET object represents a valid Revit entity.